florinbaciuu/t-hmi-esp-idf-vscode-project/.demo/old/2. LVGL/LVGL 9 My Implementation Demo [working-in-progress]/v0003,alpha0003/11.08August.2025-15.41pm/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_LOG_COLORS=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=n
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition.csv"
CONFIG_XPT2046_VREF_ON_MODE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_DUMP_RTL_FILES=y
CONFIG_CONSOLE_SORTED_HELP=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_CACHE_SAFE=y
CONFIG_GPTIMER_ENABLE_DEBUG_LOG=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_ESP_SLEEP_DEBUG=y
CONFIG_LCD_ENABLE_DEBUG_LOG=y
CONFIG_PM_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ECC_ENABLE=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=128
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=9000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=6
CONFIG_ESP_IPC_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_PROFILING=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL=y
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=20
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_FATFS_VOLUME_COUNT=3
CONFIG_FATFS_FS_LOCK=2
CONFIG_FATFS_USE_STRFUNC_WITH_CRLF_CONV=y
CONFIG_FATFS_PRINT_LLI=y
CONFIG_FATFS_PRINT_FLOAT=y
CONFIG_FATFS_IMMEDIATE_FSYNC=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=6
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048
CONFIG_FREERTOS_USE_IDLE_HOOK=y
CONFIG_FREERTOS_USE_TICK_HOOK=y
CONFIG_FREERTOS_TIMER_SERVICE_TASK_NAME="Tmr Srvc"
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=2
CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG=y
CONFIG_FREERTOS_ISR_STACKSIZE=2048
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_HEAP_TASK_TRACKING=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_SIZE=63
CONFIG_LOG_COLORS=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_NVS_ASSERT_ERROR_CHECK=y
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_SPI_FLASH_BROWNOUT_RESET_XMC=n
CONFIG_SPI_FLASH_HPM_DIS=y
CONFIG_SPIFFS_CACHE_STATS=y
CONFIG_SPIFFS_DBG=y
CONFIG_SPIFFS_TEST_VISUALISATION=y
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_FSM=y
CONFIG_UNITY_ENABLE_COLOR=y
CONFIG_VFS_SELECT_IN_RAM=y
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=2
CONFIG_ESP_LCD_TOUCH_MAX_POINTS=1
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
